"""
Додавання одного або кількох рядків до таблиці SQLite.
Додавання цілих чисел, рядків, чисел з плаваючою точкою, з подвійною точністю, а також значень datetime в таблицю
SQLite.
Використання запитів із параметрами для додавання змінних Python як динамічних даних до таблиці.
Перед виконанням наступних програм потрібно переконатися, що вам відома назва таблиці, а також інформація про неї
колонках.


-----------------Вставити рядок у таблицю SQLite---------------------------

Наразі таблиця sqlitedb_developers порожня, і її потрібно заповнити. Для цього необхідно виконати такі кроки:

Встановити SQLite-з'єднання з Python.
Створити об'єкт Cursor за допомогою об'єкта з'єднання.
Створити INSERT-запит. Для цього потрібно знати таблицю та подробиці про колонки.
Виконати запит за допомогою cursor.execute().
Після успішного завершення слід не забути виконати коміт змін до бази даних.
Також важливо не забути перехопити винятки SQLite.
Нарешті слід перевірити результат, повернувши дані з таблиці.
"""

import sqlite3


try:
    # Встановлюємо з'єднання з БД
    sqlite_connection = sqlite3.connect('sqlite_python.db')
    # Отримання об'єкта cursor з об'єкта з'єднання
    cursor = sqlite_connection.cursor()
    print("Підключений до SQLite")
    # INSERT-запит для вставлення даних у таблицю. У ньому вказуються назви колонок та їх значення.
    # Усього в таблиці 5 колонок:
    sqlite_insert_query = """INSERT INTO sqlitedb_developers
                          (name, email, joining_date, salary)
                          VALUES
                          ('Oleg1', 'oleg0459@gmail1.com', '2020-11-19', 5100);"""
    # За допомогою методу execute() об'єкта сursor виконується запит INSERT
    count = cursor.execute(sqlite_insert_query)
    # Зберігаємо зміни до БД
    sqlite_connection.commit()
    # Отримання кількості відредагованих рядків:
    print("Запис успішно вставлено у таблицю sqlitedb_developers ", cursor.rowcount)
    cursor.close()

except sqlite3.Error as error:
    print("Помилка при роботі з SQLite", error)

finally:
    # Виконуємо закриття об'єктів cursor та з'єднання
    if sqlite_connection:
        sqlite_connection.close()
        print("З'єднання з SQLite закрито")


# Тепер можна перевірити результат, переглянувши таблицю через програму DB Browser.
